conf/src/InformationRegisters/ЭП_ЭффективностьСотрудников/ЭП_ЭффективностьСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭП_ЭффективностьСотрудников</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.ЭП_ПоказателиЭффективностиСотрудников</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ПериодОценивания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрофильРасчета</name>
    <type>
      <types>CatalogRef.ЭП_ПрофилиРасчетаРезультативности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ЭП_ПоказателиЭффективностиСотрудников</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/AccumulationRegisters/УчетВремени/УчетВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>УчетВремени</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>УДАЛИТЬЭтап</name>
    <type>
      <types>CatalogRef.РазделыПроекта</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДеятельности</name>
    <type>
      <types>CatalogRef.ВидыДеятельности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>CatalogRef.РазделыПроекта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТехническийПроект</name>
    <type>
      <types>CatalogRef.ТехническиеПроекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ошибка</name>
    <type>
      <types>CatalogRef.Ошибки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>CatalogRef.ЗадачиПроцесса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОписаниеРаботы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>350</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

conf/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭП_Сотрудник</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭП_ГенерацияЗаписейВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

conf/src/Catalogs/ЭП_ПрофилиРасчетаРезультативности/ЭП_ПрофилиРасчетаРезультативности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭП_ПрофилиРасчетаРезультативности</name>
  <owners>Catalog.ЭП_ГруппыРасчетныхПрофилей</owners>
  <attributes>
    <name>Департамент</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйПорог</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйПорог</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельности</name>
    <type>
      <types>CatalogRef.ВидыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ТехническаяПоддержка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ЭП_ПоказателиЭффективностиСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесовойКоэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦелевоеЗначение</name>
      <type>
        <types>Characteristic.ЭП_ПоказателиЭффективностиСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособАгрегации</name>
      <type>
        <types>EnumRef.ЭП_СпособыАгрегации</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоУмолчанию</name>
      <type>
        <types>Characteristic.ЭП_ПоказателиЭффективностиСотрудников</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

conf/src/CommonModules/ЭП_УчетВремениСервер/Module.bsl
Процедура СгенерироватьЗаписиПоПоказателюЗаПериод() Экспорт
	
	ТекущийПоказатель = Константы.ЭП_ПоказательПоУмолчанию.Получить();
	
	Если ТекущийПоказатель = ПланыВидовХарактеристик.ЭП_ПоказателиЭффективностиСотрудников.ПустаяСсылка() Тогда
		
		ЗаписьЖурналаРегистрации("ЭП_ОбновлениеДанныхПоПоказателюПоУмолчанию",
								 УровеньЖурналаРегистрации.Ошибка,
								 Метаданные.РегламентныеЗадания.ЭП_ОбновлениеДанныхПоПоказателюПоУмолчанию,
								 ,
								 "Не задано значение ЭП_ПоказательПоУмолчанию, работа регламентного задания невозможна.");						 
		 Возврат;
	
	КонецЕсли;
	
	ТекущийПользователь = Константы.ЭП_ТехническийПользователь.Получить();
	
	Если ТекущийПоказатель = Справочники.Пользователи.ПустаяСсылка() Тогда
		
		ЗаписьЖурналаРегистрации("ЭП_ОбновлениеДанныхПоПоказателюПоУмолчанию",
								 УровеньЖурналаРегистрации.Ошибка,
								 Метаданные.РегламентныеЗадания.ЭП_ОбновлениеДанныхПоПоказателюПоУмолчанию,
								 ,
								 "Не задано значение ЭП_ТехническийПользователь, работа регламентного задания невозможна.");						 
		 Возврат;
	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭП_ЭффективностьСотрудников.Сотрудник КАК Сотрудник,
	               |	ЭП_ЭффективностьСотрудников.Значение КАК Значение
	               |ПОМЕСТИТЬ ВТ_ТекущиеЗначения
	               |ИЗ
	               |	РегистрСведений.ЭП_ЭффективностьСотрудников КАК ЭП_ЭффективностьСотрудников
	               |ГДЕ
	               |	ЭП_ЭффективностьСотрудников.ПериодОценивания = &ПериодОценивания
	               |	И ЭП_ЭффективностьСотрудников.Показатель = &Показатель
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Сотрудник
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	&ПериодОценивания КАК ПериодОценивания,
	               |	&Ответственный КАК Ответственный,
	               |	УчетВремениОбороты.Проект КАК Проект,
	               |	УчетВремениОбороты.Пользователь.ЭП_Сотрудник КАК Сотрудник,
	               |	ЭП_ПрофилиРасчетаРезультативности.Ссылка КАК ПрофильРасчета,
	               |	&Показатель КАК Показатель,
	               |	УчетВремениОбороты.ДлительностьОборот / 3600 КАК Значение
	               |ИЗ
	               |	РегистрНакопления.УчетВремени.Обороты(НАЧАЛОПЕРИОДА(&ПериодОценивания, МЕСЯЦ), ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&ПериодОценивания, МЕСЯЦ), ДЕНЬ, 5), , ) КАК УчетВремениОбороты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭП_ПрофилиРасчетаРезультативности КАК ЭП_ПрофилиРасчетаРезультативности
	               |		ПО УчетВремениОбороты.ВидДеятельности = ЭП_ПрофилиРасчетаРезультативности.ВидДеятельности
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТекущиеЗначения КАК ВТ_ТекущиеЗначения
	               |		ПО УчетВремениОбороты.Пользователь.ЭП_Сотрудник = ВТ_ТекущиеЗначения.Сотрудник
	               |			И (НЕ УчетВремениОбороты.ДлительностьОборот = ВТ_ТекущиеЗначения.Значение)
	               |ГДЕ
	               |	УчетВремениОбороты.Пользователь.ЭП_ГенерацияЗаписейВремени
	               |	И НЕ ВТ_ТекущиеЗначения.Сотрудник ЕСТЬ NULL"; 
	Запрос.УстановитьПараметр("ПериодОценивания", НачалоМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("Ответственный", ТекущийПользователь);
	Запрос.УстановитьПараметр("Показатель", ТекущийПоказатель); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "За выбранный период не найдено внесенных часов.";        
		Сообщение.Сообщить();
		Возврат;		
	
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	НаборДанных = РегистрыСведений.ЭП_ЭффективностьСотрудников.СоздатьМенеджерЗаписи();
	
	Пока Выборка.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(НаборДанных, Выборка); 
		НаборДанных.Комментарий = "Запись созданна автоматической обработкой.";
		НаборДанных.Записать();
	
	КонецЦикла;
	
КонецПроцедуры
